** ブロックの基本

#+BEGIN_SRC ruby :exports both :tangle babel/mymethod.rb :mkdirp yes
class Myclass
  def mymethod(a, b)
    z = -100
    if block_given?
      yield(a, b)
    else
      a + b
    end
  end
end
z=100
p @obj = Myclass.new
p @obj.mymethod(1,2) { |x,y| x+y+z  }
p @obj.mymethod(1,2) do |x,y| x+y+z; end
p @prc = Proc.new { |x,y| x+y+z }
p @prc.binding
p (@prc.binding).eval("z")

#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh :results output :export both
ruby babel/mymethod.rb

#+END_SRC

#+RESULTS:
: #<Myclass:0x007f86a11619d8>
: 103
: 3
: #<Proc:0x007f86a11617f8@babel/mymethod.rb:14>
: #<Binding:0x007f86a1161708>
: 100

*** コードの実行

- ブロックはコード
- *self*が実行の主体 (場)
- クロージャ = コード + *束縛* (局所変数，インスタンス変数，... )

file://~suzuki/COMM/Lects/meta-ruby/code/blocks/closure.rb

#+BEGIN_SRC ruby :tangle babel/make_and_do_block.rb

def do_block
  x = "do block"
  yield("yield_block")
end

class Myclass
  C = "constant"
  def make_and_do_block
    x = "make block"
    do_block {|y| "Variables C:#{C} x:#{x}, y:#{y}" }
  end
end

puts block = (Myclass.new).make_and_do_block
#+END_SRC

#+BEGIN_SRC sh :results output raw
ruby babel/make_and_do_block.rb

#+END_SRC

#+RESULTS:
Variables C:constant x:make block, y:yield_block

- =Myclass= のオブジェクトの =make_and_do_block= メソッド中で作られたブ
ロック ={|y| "Variables C:#{C} x:#{x}, y:#{y}" }= は，do_blockの中で，
=yield= で呼び出され実行される。

- ="Variables C:#{C} x:#{x}, y:#{y}"= が実行され，

- 実行されている環境で見える， 定数 =C=, =x=， =y= の値が使われる。

- その値から，=Myclass=の中の =make_and_do_block= メソッドの中にいる
  ことがわかる。

ブロックが生まれるとき，自身が生まれた環境を閉じ込めた ((*クロージャ*))
となる

クロージャが実行される時は，その環境で実行される
- 定数はselfのクラスから辿れる
- インスタンス変数、特異メソッドには self から辿れる

